trainingExperts/2_trainingSECexpert/inputs/baseline/system/extractLines_fd
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a surface, specified by one point and a normal direction.

\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

interpolationScheme	cellPointFace;

setFormat   raw;

fields  (avgfdMean);

sets
(
line0
{
	type        uniform;
	axis 			y;
	start 		(5.0 		-0.999 		-0.999);
	end 			(5.0		-0.001			-0.001);
	nPoints 	500;
}
line1
{
	type        uniform;
	axis 			y;
	start 		(5.0 		-0.999 		-0.95);
	end 			(5.0		-0.001			-0.95);
	nPoints 	500;
}
line2
{
	type        uniform;
	axis 			z;
	start 		(5.0 		0.0 		-0.999);
	end 			(5.0		0.0			-0.001);
	nPoints 	500;
}
) ;

// ************************************************************************* //
